JorgeArturo/lpc845/Tutorial_DMA_3/source/Tutorial_DMA_3.c
/*
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of NXP Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
 
/**
 * @file    Tutorial_DMA_3.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "LPC845.h"
#include "fsl_debug_console.h"
#include "fsl_power.h"
#include "fsl_inputmux.h"
/* TODO: insert other include files here. */

uint8_t DMADone = false;
uint16_t DstAddress[10];

/* TODO: insert other definitions and declarations here. */


void DMA0_Callback(struct _dma_handle *handler, void *userdata, bool done, uint32_t tcds){

	if(tcds == kDMA_IntA){

		DMADone = true;

	}



}

/*
 * @brief   Application entry point.
 */
int main(void) {

	POWER_DisablePD(kPDRUNCFG_PD_ADC0);

  	/* Init board hardware. */
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    /* Init FSL debug console. */
    BOARD_InitDebugConsole();
#endif

    PRINTF("Trigger by Hardware\n");

    INPUTMUX_Init(INPUTMUX);

    INPUTMUX_AttachSignal(INPUTMUX,DMA0_CH0_DMA_CHANNEL,kINPUTMUX_AdcASeqaIrqToDma);

    CTIMER_StartTimer(CTIMER0_PERIPHERAL);

    /* Enter an infinite loop, just incrementing a counter. */
    while(1) {

    	while(!DMADone);
    	DMADone = false;

    	PRINTF("DstAddress = %u\r\n",(DstAddress[0]>>4));

    }
    return 0 ;
}
